from pydantic import BaseModel


class DefaultMessages(BaseModel):
    """Стандартные сообщения ответов пользователю."""

    START_BOT_MESSAGE: str = "🌍 Главное меню бота"
    OPTIONS_BOT_MESSAGE: str = "🚦 Доступные варианты"
    TRY_REPSONSE_MESSAGE: str = "👣 Попробуйте, снова, сделать запрос..."
    WAIT_MESSAGE: str = "⏳ Идет обработка запроса..."
    CANCEL_MESSAGE: str = "❌ Отменены все действия"
    NOT_PHOTO_MESSAGE: str = (
        "⚠ Изображение должно быть в формате .jpg, "
        ".jpeg или .png. Скидывайте изображения снова"
    )
    NETWORK_ERROR: str = "🚫 Ошибка сети. Попробуйте позже."
    UNKNOWN_STATUS_ERROR: str = "🚫 Сайт вернул неожиданный ответ."
    SERVER_ERROR: str = "⚙️ Внутренняя ошибка сервера."
    TIMEOUT_ERROR: str = "⌛ Сервер не ответил вовремя."

    BUTTON_CANCEL_MESSAGE: str = (
        "❌ Запрос отменен\n🚛" " Идет остановка процесса.Пожалуйста ожидайте..."
    )
